// The ASR rules have a dedicated reporting portal at https://security.microsoft.com . 
// However, no such report exists for other W10 security features - this would be a query for any CFA related activity
DeviceEvents
| where ActionType startswith "ControlledFolderAccess"
