//Alert on SKILL.md created by suspicious processes
DeviceInfo
| where OSPlatform == "macOS"
|distinct DeviceId
|join DeviceFileEvents on DeviceId
| where Timestamp > ago(1d)
| where ActionType == "FileCreated"
| where tolower(FileName) in ("skill.md", "skills.md", "soul.md")
| where InitiatingProcessFileName in ("curl", "wget", "python", "python3","bash", "sh", "zsh", "nscurl", "scp") or isnotempty(FileOriginUrl)
| project Timestamp, DeviceName, FileName, FolderPath,FileOriginUrl, FileSize, InitiatingProcessFileName, InitiatingProcessCommandLine
